clear;
close all;
clc;
plane = imread('kodim20.png');
light = imread('dark.png');
low_contrast = rgb2gray(imread('low_contrast.tif'));
parrot = imread('D:\навчання\CV2024\lesson_5\data\kodim23.png');
figure('Name', 'low_contrast'), imshow(low_contrast), figure('Name', 'plane'), imshow(plane), figure('Name', 'light'), imshow(light), figure('Name', 'parrot'), imshow(parrot)
whos low_contrast
whos plane
whos light
whos parrot
imwrite(low_contrast, 'low_contrast_copy.tif')
figure, imhist(low_contrast), figure, imhist(plane), figure, imhist(light), figure, imhist(parrot)
figure, imshow(imadjust(low_contrast))
figure, imshow(figure, imshow(imadjust(plane, [0, 1], [1, 0], 1.5)))

% “Гістограма розподілу яскравостей” — це графік, який показує, скільки пікселів зображення мають 
% кожне зі значень інтенсивності (від найтемніших до найсвітліших). 
% По горизонталі відкладають рівні яскравості (наприклад, 0…255), а по вертикалі – кількість пікселів із цією інтенсивністю.

% “Контрастність зображення” — це міра різниці між темними й світлими ділянками. 
% Висока контрастність означає, що в зображенні є чіткі відмінності між світлом і тінню, 
% а низька — що відтінки розташовані близько один до одного, роблячи картинку «плоскішою».

% Як при контрастуванні змінюється гістограма:
% – При підвищенні контрасту гістограму «розтягують» на весь доступний діапазон: темні піки зміщуються до лівого краю, світлі — до правого, а середні тони розходяться далі один від одного.
% – При зниженні контрасту її «стискають», звужуючи розподіл інтенсивностей до центральної частини.

% Як зменшити контрастність зображення:
% потрібно «згорнути» діапазон яскравостей — наприклад, задати менший вхідний або ширший вихідний діапазон
% при лінійній розтяжці гістограми, зменшити коефіцієнт γ (гамма‑корекції) або використати слабший низькочастотний фільтр, 
% що вирівнює різкі переходи.

% Як одержати негативне зображення:
% достатньо інвертувати інтенсивності кожного пікселя