close all;
clear;
clc;

%% 1. Завантажити з бібліотеки MATLAB тестове зображення.
I = imread('coins.png');

%% 2. Відобразити вихідні зображення на екрані ПК.
figure, imshow(I), title('Вихідне зображення');

%% 3. Здійснити процедуру перекручення зображення
LEN = 21;
THETA = 0;
PSF = fspecial('motion', LEN, THETA);
blurred = imfilter(I, PSF, 'conv', 'circular');

%% 4. Відобразити перекручене зображення.
figure, imshow(blurred), title('Змазане зображення');

%% 5. Виконати процедуру відновлення зображення.
wnr1 = deconvwnr(blurred, PSF, 0);

%% 6. Відобразити зображення після відновлення. 
figure, imshow(wnr1), title('Відновлене зображення');

%% 7. Виконати зашумлення початкового зображення та повторити пункти 2-6.
noisyImg = imnoise(I, 'gaussian', 0, 0.01);
figure, imshow(noisyImg), title('Вихідне зашумлене зображення ');
LEN = 21;
THETA = 0;
PSF = fspecial('motion', LEN, THETA);
blurred = imfilter(noisyImg, PSF, 'conv', 'circular');
figure, imshow(blurred), title('Змазане зашумлене зображення');
wnr1 = deconvwnr(blurred, PSF, 0);
figure, imshow(wnr1), title('Відновлене зашумлене зображення');

%% поясніть процес формування зображення.
% Процес формування зображення полягає в перетворенні вихідного об'єкту у зображення, яке можна спостерігати. 
% Цей процес може бути позначений оператором перекручень
%% опишіть модель формування зображень та лінійних перекручень.
% Модель формування зображень описує процес перетворення вихідного об'єкту в спостережуване зображення через дію різних факторів,
% таких як фокусування камери, вплив атмосферних умов, рух камери тощо
%% поясніть процес відновлення перекрученого зображення.
% Процес відновлення перекрученого зображення полягає в застосуванні оберненої операції до спостережуваного зображення з метою 
% відновлення оригінального, неперекрученого зображення


